backend/app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("category_name", "discarded_at", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["category_name", "Dog"], ["discarded_at", nil], ["created_at", "2025-04-15 08:59:02.946381"], ["updated_at", "2025-04-15 08:59:02.946381"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @category = Category.find(params[:id])