backend/app/controllers/admin/donate_pets_controller.rb

SELECT "donate_pets".* FROM "donate_pets" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @donate_pets = DonatePet.includes(user: {}, pet: { breed: :category }).all.paginate(page: params[:page], per_page: 10)

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ?  [["id", 7]]
---
  def set_donate_pet
    @donate_pet = DonatePet.find_by(id: params[:id])