backend/app/controllers/admin/pets_controller.rb

  def index
    load_categories_and_breeds
    @q = Pet.kept.includes(:category, :breed).ransack(params[:q])
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 2], ["id", 1]]

  def create
    @pet = Pet.new(pet_params)
    if @pet.save
---
INSERT INTO "pets" ("age", "gender", "temperament", "vaccination_status", "medical_history", "recommended_food", "common_health_issues", "status", "pet_image_url", "breed_id", "category_id", "discarded_at", "created_at", "updated_at", "age_unit") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    remove_images if params[:pet][:removed_images].present?
    attach_images(@pet) if params[:pet][:pet_images].present?

    if @pet.update(pet_params.except(:pet_images))
---
UPDATE "pets" SET "gender" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["gender", 1], ["updated_at", "2025-04-16 09:03:09.035591"], ["id", 1]]

  def set_pet
    @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]