app/controllers/admin/adopt_pets_controller.rb

  def index
    @adopt_pets = AdoptPet.includes(user: {}, pet: { breed: :category }).all.paginate(page: params[:page], per_page: 10)
---
SELECT "adopt_pets".* FROM "adopt_pets" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    @adopt_pet = AdoptPet.includes(user: {}, pet: { breed: :category }).find(params[:id])
---
SELECT "adopt_pets".* FROM "adopt_pets" WHERE "adopt_pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]

  def update
    @adopt_pet = AdoptPet.find(params[:id])  # Ensure @adopt_pet is set
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "adopt_pets".* FROM "adopt_pets" WHERE "adopt_pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update_adopt_pet_status
  previous_status = @adopt_pet.status  # Store previous status
  if previous_status != params[:adopt_pet][:status] # Ensure status is changing
    if @adopt_pet.update(adopt_pet_params)
---
UPDATE "adopt_pets" SET "status" = ?, "updated_at" = ? WHERE "adopt_pets"."id" = ?  [["status", 1], ["updated_at", "2025-04-16 09:49:29.828108"], ["id", 1]]

  def set_adopt_pet
    @adopt_pet = AdoptPet.find_by(id: params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]