app/controllers/admin/breeds_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 2], ["id", 1]]
---
  def index
    @breeds = Breed.kept.includes(:category).paginate(page: params[:page], per_page: 5)

INSERT INTO "breeds" ("breed_name", "category_id", "discarded_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["breed_name", "American Polydactyl"], ["category_id", 2], ["discarded_at", nil], ["created_at", "2025-04-16 06:23:35.471144"], ["updated_at", "2025-04-16 06:23:35.471144"]]
---
  def create
    @breed = Breed.new(breed_params)

    if @breed.save