app/controllers/api/v1/pets_controller.rb

  def index
    pets = Pet.kept.includes(:breed, :category)

    if pets.any?
      render json: {
        success: true,
        pets: pets.map { |pet| pet_data(pet) }
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 2], ["id", 1]]

  def show
    pet = Pet.kept.includes(:breed, :category).find_by(id: params[:id])
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" = ?  [["id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]