backend/app/controllers/api/v1/adopt_pets_controller.rb

SELECT "adopt_pets".* FROM "adopt_pets" WHERE "adopt_pets"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "adopt_pets" WHERE "adopt_pets"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
    def show_adoptions
      adopt_pets = current_user.adopt_pets.includes(pet: [ :breed, :category ])

      if adopt_pets.exists?
        render json: {
          success: true,
          data: adopt_pets.map { |adoption| adoption_data(adoption) }

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "adopt_pets" ("email", "address", "phone_no", "expected_adoption_date", "actual_adoption_date", "status", "user_id", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      user = User.find_by(id: params[:u_id])
      pet = Pet.find_by(id: params[:p_id])

      if user.nil? || pet.nil?
        return render json: { success: false, message: "Invalid user or pet." }, status: :unprocessable_entity
      end

      adoption_params = params.require(:adopt_pet).permit(:email, :phone_no, :address, :expected_adoption_date)

      adoption = AdoptPet.new(
        user_id: user.id,
        pet_id: pet.id,
        email: adoption_params[:email],
        phone_no: adoption_params[:phone_no],
        address: adoption_params[:address],
        expected_adoption_date: adoption_params[:expected_adoption_date],
        actual_adoption_date: adoption_params[:expected_adoption_date], # Same as expected
      )

      if adoption.save