backend/app/controllers/api/v1/base_controller.rb

  def authenticate_user
    token = request.headers["Authorization"]&.split(" ")&.last
    decoded = JwtHelper.decode_token(token)

    unless decoded.present? && decoded["user_id"].present? && (@current_user = User.find_by(id: decoded["user_id"]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]