backend/app/controllers/api/v1/donate_pets_controller.rb

  def show_donations
    donate_pets = current_user.donate_pets.includes(pet: [ :breed, :category ])

    if donate_pets.exists?
      render json: {
        success: true,
        data: donate_pets.map { |donation| donation_data(donation) }
---
SELECT "donate_pets".* FROM "donate_pets" WHERE "donate_pets"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "donate_pets" WHERE "donate_pets"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def create_pet
    pet = Pet.new(pet_params)

    if pet.save
---
INSERT INTO "pets" ("age", "gender", "temperament", "vaccination_status", "medical_history", "recommended_food", "common_health_issues", "status", "pet_image_url", "breed_id", "category_id", "discarded_at", "created_at", "updated_at", "age_unit") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def create_donation
    @pet = Pet.find_by(id: params[:pet_id])  # Ensure @pet is set

    return render json: { success: false, message: "Pet not found" }, status: :not_found unless @pet

    donate_pet = current_user.donate_pets.new(donate_pet_params.merge(pet_id: @pet.id))

    if donate_pet.save
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "donate_pets" ("address", "phone_no", "status", "expected_donate_date", "actual_donate_date", "user_id", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_pet
    @pet = Pet.find_by(id: params[:pet_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ?  [["id", 7]]