backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "profile_img_url", "email", "phone_no", "role", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "discarded_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    # Attach profile image if provided
    if params[:user][:profile_image].present?
      @user.profile_image.attach(params[:user][:profile_image])
    end

    if @user.save