app/views/admin/adopt_pets/_adopt_pet.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  <td><%= index %></td>
  <td><%= adopt_pet.user.first_name %> <%= adopt_pet.user.last_name %></td>