app/views/admin/adopt_pets/show.html.erb

                <ul class="list-group list-group-flush">
                  <li class="list-group-item"><strong>Name:</strong> <%= @adopt_pet.user.first_name %> <%= @adopt_pet.user.last_name %></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 2]]