app/views/admin/donate_pets/_donate_pet.html.erb

  <td><strong><%= index %></strong></td>
  <td><%= donate_pet.user.first_name %> <%= donate_pet.user.last_name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 2]]